🚀&nbsp; env0 had composed a PR Plan for environment [kubernetes-sandbox-centralus](https://app.env0.com/p/fcd71414-7e7b-49c5-9c7e-9ec398e825f4/environments/23a5bc8e-ef9d-4b82-8603-70b79b376437):
```
Plan: 3 to add, 0 to change, 0 to destroy.
```

<details>

<summary>Plan Details</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_virtual_network.vnet has been changed
  ~ resource "azurerm_virtual_network" "vnet" {
      + dns_servers           = []
        id                    = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/sandbox-centralus/providers/Microsoft.Network/virtualNetworks/demo-sandbox-centralus-vnet"
        name                  = "demo-sandbox-centralus-vnet"
      ~ subnet                = [
          + {
              + address_prefix = "10.100.0.0/20"
              + id             = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/sandbox-centralus/providers/Microsoft.Network/virtualNetworks/demo-sandbox-centralus-vnet/subnets/demo-sandbox-centralus-private-subnet"
              + name           = "demo-sandbox-centralus-private-subnet"
              + security_group = ""
            },
        ]
      + tags                  = {}
        # (5 unchanged attributes hidden)
    }
  # azurerm_subnet.private_subnet has been changed
  ~ resource "azurerm_subnet" "private_subnet" {
        id                                             = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/sandbox-centralus/providers/Microsoft.Network/virtualNetworks/demo-sandbox-centralus-vnet/subnets/demo-sandbox-centralus-private-subnet"
        name                                           = "demo-sandbox-centralus-private-subnet"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:


  # azurerm_kubernetes_cluster.default will be created
  + resource "azurerm_kubernetes_cluster" "default" {
      + dns_prefix              = "silvios-sandbox-demo"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubernetes_version      = "1.19.11"
      + location                = "centralus"
      + name                    = "demo-sandbox-centralus-aks"
      + node_resource_group     = (known after apply)
      + private_cluster_enabled = (known after apply)
      + private_dns_zone_id     = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "sandbox-centralus"
      + sku_tier                = "Free"

      + addon_profile {
          + aci_connector_linux {
              + enabled = false
            }

          + azure_policy {
              + enabled = false
            }

          + http_application_routing {
              + enabled                            = false
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = false
            }

          + oms_agent {
              + enabled            = false
              + oms_agent_identity = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + max_count                    = 10
          + max_pods                     = 100
          + min_count                    = 1
          + name                         = "systempool"
          + node_count                   = 1
          + only_critical_addons_enabled = false
          + orchestrator_version         = "1.19.11"
          + os_disk_size_gb              = (known after apply)
          + os_disk_type                 = "Managed"
          + type                         = "VirtualMachineScaleSets"
          + vm_size                      = "Standard_D4s_v3"
          + vnet_subnet_id               = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/sandbox-centralus/providers/Microsoft.Network/virtualNetworks/demo-sandbox-centralus-vnet/subnets/demo-sandbox-centralus-private-subnet"

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true

          + azure_active_directory {
              + admin_group_object_ids = [
                  + "d5075d0a-3704-4ed9-ad62-dc8068c7d0e1",
                ]
              + managed                = true
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }


  # azurerm_role_assignment.aks_subnet will be created
  + resource "azurerm_role_assignment" "aks_subnet" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/sandbox-centralus/providers/Microsoft.Network/virtualNetworks/demo-sandbox-centralus-vnet/subnets/demo-sandbox-centralus-private-subnet"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.resource_group will be created
  + resource "azurerm_role_assignment" "resource_group" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/sandbox-centralus"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```
</details>

  ```
Monthly cost change for smsilva/terraform/kubernetes/.tf-plan
Amount:  +$161 ($0.00 -> $161)

```

<details>

<summary>Cost Estimation Details</summary>

```
Project: smsilva/terraform/kubernetes/.tf-plan

+ azurerm_kubernetes_cluster.default
  +$161

    + default_node_pool
    
        + Instance usage (pay as you go, Standard_D4s_v3)
          +$161
    
        + os_disk
        
            + Storage (P1)
              +$0.74

Monthly cost change for smsilva/terraform/kubernetes/.tf-plan
Amount:  +$161 ($0.00 -> $161)

----------------------------------
Key: ~ changed, + added, - removed
```
</details>

  
[Full Plan Logs on env0](https://app.env0.com/p/fcd71414-7e7b-49c5-9c7e-9ec398e825f4/environments/23a5bc8e-ef9d-4b82-8603-70b79b376437/deployments/bbbfd5a8-6d12-498e-a202-4f11e1695286)